//Точка с запятой

console.log('Учим');
console.log('JS');

25								//литерал целого числа
32.8							//Литерал дробного числа ЗАКОНЧИТЬ ПОТОМ!!!! таймкод урок 2 2:40
"JawaSkript"				//Литерал строки
'JawaSkript'				//Литерал строки
//[]							//Литерал массива
[23,7,15]					//Литерал массива
{}								//Литерал объекта
{
	name: 'Фрилансер'
	surname: 'По жизни'
}								//Литерал объекта
//(ab|bc)					//Литерал регулярного выражения
//В языках программирования константы и переменные
//используются для хранения значений данных

const MAX_VALUE = 17;				//Константа 
var section = 'JS';					//Переменная
let arr = ['HTML','CSS','JS'];	//Переменная

/*
ОПЕРАТОРЫ
В JS имеется очень много различных операторов.
Они обозначают операцию которую нужно произвести.
*/

//Примеры операторов: + - * / = **
//До и после операторов принято ставить пробел

console.log('Учим ' + 'JS');

//Примеры выражений:
let num = 4;			//выражение присвоения
console.log(num);
'Учим ' + 'JS'			//выражение без присвоения

function name() {
console.log('Учим');
console.log('JS');
}

name();